// pages/Study/Time/time.js
Page({

  /**
   * Page initial data
   */
  data: {
    classData0: [
      "考研是什么：\n全国硕士研究生统一招生考试（Unified National Graduate Entrance Examination），简称“考研”。是指教育主管部门和招生机构为选拔研究生而组织的相关考试的总称，由国家考试主管部门和招生单位组织的初试和复试组成。",
      "研究生种类：\n按照培养目标和培养方式，可分为学术型和专业学位研究生两种。专业学位与学术型学位处于同一层次，培养规格各有侧重，在培养目标上有明显差异。学术型学位按学科设立，其以学术研究为导向，偏重理论和研究，培养大学教师和科研机构的研究人员；而专业学位以专业实践为导向，重视实践和应用，培养在专业和专门技术上受到正规的、高水平训练的高层次人才。专业学位教育的突出特点是学术型与职业性紧密结合，获得专业学位的人，主要不是从事学术研究，而是从事具有明显职业背景的工作，如工程师、医师、教师、律师、会计师等。专业学位与学术型学位在培养目标上各自有明确的定位，因此，在教学方法、教学内容、授予学位的标准和要求等方面均有所不同。",
      "学习方式：\n按学习方法不同，分为全日制研究生和在职研究生。前者指在高等学校和科研机构进行全日制学习的研究生；后者指在学习期间仍在原工作岗位承担一定工作任务的研究生。",
      "推免生：\n推免生，全称“推荐优秀应届本科毕业生免试攻读硕士学位研究生”，是指可以不用参加研究生考试而直接读研的一种情形。经审定可以开展推免生工作的高等学校，可以推荐该校规定数量的优秀应届本科毕业生免初试，并在规定的日期前直接到报考单位参加复试和办理接收手续。推荐和接收办法由学校（招生单位）根据教育部的有关规定制定。被接收的推免生（包括研究生支教团和农村教育硕士项目的推免生）须在国家规定的报名时间内到报考点办理报名确认手续，亦不得再参加统考。在规定的日期内仍未落实接收招生单位的推免生不再保留推免资格。每年推研的时间为大四上学期9月初到9月末。推免时间一般是每年的9月初开始。",
      "考试方式：\n包括全国统考、单独考试、管理类联考、法硕联考、强军计划、援藏计划。\n全国统考：只能报考除工商管理硕士、公共管理硕士、旅游管理硕士、工程管理硕士、会计硕士、图书情报硕士、审计硕士、法律硕士(非法学)、法律硕士(法学)外的学科(类别)、专业(领域)，注意工程硕士中的项目管理、教育硕士中的教育管理、体育硕士中的竞赛组织应届毕业生不得报考，请仔细阅读招生单位发布的招生简章\n单独考试：专业学位只能报考建筑学硕士、工程硕士、城市规划硕士、农业推广硕士、兽医硕士、风景园林硕士、林业硕士、临床医学硕士、口腔医学硕士、公共卫生硕士、护理硕士、药学硕士、中药学硕士等13个专业学位类别，学术型专业均可报考。\n管理类联考：只能报考工商管理硕士、公共管理硕士、旅游管理硕士、工程管理硕士、会计硕士、图书情报硕士、审计硕士。\n法硕联考：只能报考法律硕士(非法学)、法律硕士(法学)类别领域。\n法硕联考：只能报考法律硕士(非法学)、法律硕士(法学)类别领域。\n援藏计划：只能报考除工商管理硕士、公共管理硕士、旅游管理硕士、工程管理硕士、会计硕士、图书情报硕士、审计硕士、法律硕士(非法学)、法律硕士(法学)外的学科(类别)、专业(领域)，需要从西藏考试院获取校验码。 ",
      ],

  },

})