// pages/Study/Time/time.js
Page({

  /**
   * Page initial data
   */
  data: {
    Data0: [
      "学分制：教育模式的一种，以选课为核心，教师指导为辅助，通过绩点和学分，衡量学生学习质和量的综合教学管理制度。每个专业都有必修课、选修课、公共选修课等等，不同专业毕业所需学分数也不同",
      "关于选课：\n选课时间一般在每学期期末阶段至下学期起初（大一新生在正式开学前完成初次选课），分为初选课、复选课、补退选、网上申请、调整选课四个阶段。 ",
      "初选课阶段:\n初选课阶段，学生登陆学分制系统进行课程预选，该阶段结束后至复选课阶段开始前，学分制系统将根据各课程选课人数情况、在选课人数超学位数时考虑专业年级等优先级因素（同等优先级则随机）分配课程学位。",
      "复选课阶段：\n复选课阶段，学生可直接在学分制系统补选课程，此阶段选课不考虑优先级，先到先得。同时，课程附属的教材选订环节也将在该阶段后最终确认（大一新生第一学期默认全部选课教材统一订购）。",
      "补退选阶段:\n补退选阶段，学生可根据自身情况选择继续进行课程的补退选。",
      "网上申请阶段:\n网上申请阶段，在此时间段内，学生可以登录系统在“我要选课”-“查看备选课程”，点击选课列表中每门课最后的申请选项，在网上提交申请。（该申请只针对通识（核心）课程和部分外专业开设的基础课。英语语言中心课程、马克思主义学院课程和本专业课程直接提交纸质版申请单到相关开课单位教务员处理。）。",
      "调整选课阶段:\n调整选课阶段，选课学生请在规定时间内自行登录系统进行补退课（特殊原因无法自行调整选课，比如因重修冲突无法选课、修读双学位、超学分选课等，请在学分制系统中填报选课变更申请，打印后由相关教师签名并于第四阶段（网上申请阶段）期间提交教务员）。调整选课时间结束后，教务处将正式颁布秋季开课计划，不再进行选课的调整",
    ],
    Data1: [
      "网络课程：\n网络课程通过慕课的形式，学生在线根据个人时间安排学习，无需按时到课室上课，同样可以获得线下课程同等的学分。但期末需要参与期末理论考核（上机答题），成绩评分综合考量线上参与情况以及期末理论机试成绩；",
      "公益课程：\n公益课是汕大本科生教育特色之一，学生在校期间至少需要完成一门公益课的修习（1学分）。课程参与时间灵活，如在周三下午停课时间、周末、寒暑假，一般参与周期为数周至半学期。",
    ],
  },

})