// pages/Life/living/living.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    data:[
      "1. 书院：\n学校宿舍楼称为书院，共有八大书院（至诚、弘毅、知行、思源、德馨、明德、敬一、修远）和短期住宿书院——淑德女子书院",
      "2. 德馨书院：\n男女混住的书院制，1-3楼是男生宿舍，4-6楼住女生，除了每层楼四个拐角是6人间外，其余均为4人间，舍友可能都来自不同专业、不同年级，1200元/学年，部分宿舍600元/学年。独立卫浴，阳台、可自行装配洗衣机，并配多台公共洗衣机与烘干机，自助打印机，自助贩卖机，24小时自习室。德馨书院离东门和四饭都很近滴！",
      "3. 至诚书院:\n至诚书院与2008年成立，是汕大历史最悠久的书院，也是男女混住滴，有独立卫浴，24H热水供应，有阳台，可连外网（校园网每天0点断网），可自行装配洗衣机，有自助打印机，自助贩卖机，24小时自习室，自助餐饮，健身房，活动室和舞蹈房等公共设备。至诚和德馨距离很近，同样离东门和四饭很近。",
      "4. 明德书院、敬一书院、修远书院:\n这3座书院都是以4人一间为主，部分3或6人间，上床下桌，配空调、电扇，各床位单独匹配网络端口和电源插座，公共卫浴（非大澡堂）。每个书院配多台公共洗衣机与烘干机、自助贩卖机、自习室、自助餐饮区域（仅明德书院）。",
      "5. 弘毅书院、思源书院、知行书院:\n每个宿舍分为A、B、C套间+宿舍客厅，A、C 4人一间，B 2人一间，配空调、电风扇，床位单独匹配网络端口和电源插座，有独立卫浴、阳台，可自行装配洗衣机。\n三个书院每楼层自助餐饮区配备公共冰箱、微波炉，且配备电梯，均有空中花园、琴房、24小时热水与电力、24小时自习室。健身房（知行书院、思源书院），舞蹈房（弘毅书院），戏剧厅（知行书院，用于戏剧表演、讲座等）、多功能厅（弘毅书院、知行书院，用于举办讲座等），瑜伽室（思源书院）。",
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})