// pages/DieJin/DJ_classTime/dj_classtime.js
Page({

  /**
   * Page initial data
   */
  data: {
    classData0: [
      "第1节 8:10 - 8:55 ",
      "第2节 9:05 - 9:50 ",
      "第3节 10:10 - 10:55 ",
      "第4节 11:05 - 11:50 ",
      "第5节 12:00 - 12:45 ",
      ],
    classData1: [
      "第6节 14:10 - 14:55 ",
      "第7节 15:05 - 15:50 ",
      "第8节 16:10 - 16:55",
      "第9节 17:05 - 17:50",
      "第0节 18:00 - 18:45",
    ],
    classData2: [
      "A节 19:30 - 20:15",
      "B节 20:25 - 21:10",
      "C节 21:20 - 22:05",
    ],
  },

})