// pages/Life/major/major.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    data:[
      "1. 转专业：\n转专业是指学生在学习期间由原专业转入另个专业学习。学生按招生录取的专业在校学习可根据学校的规定提出转专业申请。转专业类别主要包括:疾病救济、大类分专业学生意愿、退役大学生士兵复学等",
      "2. 什么时候可以开始转专业:\n限于新生入学后第一、第二个春季学期和第二个秋季学期。",
      "3. 大类分专业:\n大类招生的学院应根据学校的转专业制定详细的分专业规则,分专业结果须经过学院教学委员会审核、院内公示不少于5个工作日,并于第6周内将上述分专业结果及规则等材料报教务处",
      "4. 不能转专业的情况：\n1)入学未满一学期的(不包括：入学体检复查发现有不符合招生管理规定中就读该专业的疾病或生理缺陷)。\n2)在校期间已转过专业的(不包括:新生入学被要求转专业的、大类分专业)。\n3)休学、保留学籍、依据学校管理规定应予以退学或开除等学籍状况不正常的。\n4)提前批次录取的学生的高考成绩低于当年学校非提前批次本科专业投档分数线的.\n5)上级教育行政部门规定不能转专业的",
      "5. 以上文字来源于“2019年2月27日第三次校长办公室会议修订版全日制本科生转专业工作细则”",
      "6. 其他：\n不挂科是转专业的基本要求，挂了基本没机会转。\nGPA会作为一个基本的参考，高的GPA会提高你转专业的概率，但转专业成功与否不完全取决于GPA，具体需要看你想转的专业。因此，如果是已经下定决心一定要转的同学，在大一上学期的时候，就可以选一些几乎所有专业的必修的，并且好拿分的课程（比如说社科和三大领域的课程），避开那些比较难拿高分的课程（如高等微积分）。"
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})