// pages/Life/Campus_Info/campus_info.js
Page({

  /**
   * Page initial data
   */
  data: {
    data:[
    "1. 汕大新校门：\n汕大校门是由著名建筑师林樱所设计。林樱，也是才女林徽因的侄女，因设计华盛顿越战纪念碑而成名。而她设计的汕大校门既有西方的简约清新，又带着东方的灵动飘逸。古朴灰色的校门，石板墙砌筑出的弧形，既有西方的简约清新，又带着东方的灵动飘逸。墙上交错杂出的小石洞，会在幽暗的夜晚静静地发出光芒。从中可以在门外一窥校园内的景色，开放中又蕴含着神秘气质。",
    "2.真理钟：\n一道简单的金属弧吊着一个中国式的吊钟和一座石楼，构成了汕大的真理钟。抒情的金属弧形灵感来自书法的笔触，代表着思维过程的两面汇合。特别嵌入灯光的石楼，指向现代的科技与创新。钟声响起，行走在黄昏的校园小路上就如踱步于深山古寺。悠远的钟声回荡在这校园里，激励着每一个汕大人求索真理的脚步。",
    "3.大小人雕像：\n“大小人雕像”—— looking up, looking down，译名为“建立自我追求无我”。由英国著名艺术大师Zadok Ben–David设计。\n雕像由两个大小人组成：一个“小人”象征着我，正Looking up（抬头看） “大人”；而“大人”是由许许多多个“小人”组成，正Looking down（低头看） “小人”并向“小人”亲切地伸手。",
    "4. 图书馆：\n汕大图书馆被誉为”亚洲最美的图书馆 “，由香港设计中心选出的“亚洲最具影响力设计大奖”得奖者陈瑞宪设计，是李嘉诚先生亲自指定的设计师。\n以中国传统线装书盒子为设计概念，结合现代主义手法，强调横向感，空间流畅，并且相互穿透。中庭设计突显图书馆精神中枢的地位，营造庄严和安静的气氛；二楼竹庭及自修室将自然元素融为一体，引入天然日光，并配以传统园林设计绿化景观。新馆总面积达2万1千平方米，有1500个座位、27个研讨室，以及综合展览、会议、学生活动中心；全馆覆盖无线网络。",
    "5.新医学楼：\n由曾设计北京奥运会的主体育场“鸟巢”的德国设计公司Herzog & de Meuron Basel Ltd.(赫尔佐格和德默隆巴尔有限公司)担任设计顾问，其设计理念为：新医学院主楼坐落在茂盛的亚热带景观环境中，从理性排列功能用房出发，各功能竖向环绕着一个中央空间堆叠，形成学术环，衍化出建筑独有的个性。",
    "6.朱铭先生“人间系列”雕塑-绅士（十二铜人像）：\n“地狱在人间，人间有天堂，问君何处去，但凭一念间。”这是十二铜人像附近入口石刻上，作者朱铭先生为此而题的小诗。\n朱铭先生是一位国际上享有盛名的雕刻家、画家 。他雕刻的这组十二铜人像于2002年6月建成，主体结构为圆筒形，上层摆放台湾著名雕塑家朱铭先生的“人间”系列铜质雕塑，下部为半敞式水库管理室。雕塑台与水库大坝通过砼桥台连成一体，是汕头大学众多有特色的景点之一 ，与汕大水库以及背后的桑浦山构成了校园内一道美丽而又特别的风景线 ，为汕大校园增添了几分艺术气息。",
    "7.涂鸦墙：\n从2013年起，这条把汕大与后山隔开的墙开始由汕大大学长江艺术与设计学院开始进行美化，并且由长江艺术与设计学院王受之院长带领学生去创作。从此这个墙便成了汕头大学涂鸦墙。并且每一年都会组织学生去更新涂鸦。2014年邀请台湾著名艺术家Mr.Ogay在校开设工作坊与讲座，更新了涂鸦墙。\n此涂鸦非彼涂鸦。在汕大的后山，有那么一条长长的靠墙小路，而这面墙，就是我们的涂鸦墙。午饭过后，傍晚步行，沿着这条路走下去，你会看到一幅幅风格迥异的图画，可能是浪漫的，可能是诡异的，可能是幼稚的，也可能是深沉的，总之，在这面墙上，你会看到汕大学子们的朝气，他们的聪慧，他们的思想。"
    ]
  },

  /**
   * Lifecycle function--Called when page load
   */
  onLoad: function (options) {

  },

  /**
   * Lifecycle function--Called when page is initially rendered
   */
  onReady: function () {

  },

  /**
   * Lifecycle function--Called when page show
   */
  onShow: function () {
  
  },

  /**
   * Lifecycle function--Called when page hide
   */
  onHide: function () {

  },

  /**
   * Lifecycle function--Called when page unload
   */
  onUnload: function () {

  },

  /**
   * Page event handler function--Called when user drop down
   */
  onPullDownRefresh: function () {

  },

  /**
   * Called when page reach bottom
   */
  onReachBottom: function () {

  },

  /**
   * Called when user click on the top right corner to share
   */
  onShareAppMessage: function () {

  }
})